{
  "backend/main.mo": "Main backend actor implementing user profiles, title management (movies/series), ratings, and blob storage with authorization controls; includes search, CRUD operations for titles, and rating aggregation functionality.",
  "feature_evidence.json": "Feature evidence report documenting four implemented features: chunked file upload with progress tracking, removal of URL input for direct file upload, permission changes allowing all authenticated users to upload content, and admin-only deletion functionality.",
  "frontend-file-summaries.txt": "JSON-formatted summaries of all frontend files describing components, pages, hooks, and configuration files with emphasis on authentication, upload functionality, and French localization.",
  "frontend/index.css": "Tailwind CSS configuration with OKLCH color system defining dark theme variables for light and dark modes, featuring cinematic burgundy accents and deep black backgrounds.",
  "frontend/index.html": "HTML entry point for the CinéStream application with root div and module script reference to main.tsx.",
  "frontend/src/App.tsx": "Root application component configuring TanStack Router with routes for home, title detail, and upload pages, wrapped in ThemeProvider with dark theme and Toaster for notifications.",
  "frontend/src/components/AdminGuard.tsx": "Authorization guard component that checks for admin role, displaying access denied or login prompts in French with loading states and authentication checks.",
  "frontend/src/components/AuthGuard.tsx": "Authentication guard component that verifies user login status and displays French login prompt with loading skeleton for unauthenticated users.",
  "frontend/src/components/Footer.tsx": "Footer component displaying copyright, current year, and attribution link to caffeine.ai with UTM tracking parameters and animated heart icon.",
  "frontend/src/components/Header.tsx": "Navigation header with CinéStream branding, upload button for authenticated users, and login/logout functionality with query cache clearing on logout.",
  "frontend/src/components/Layout.tsx": "Main layout component that wraps pages with a dark gradient background, Header, Footer, and a radial gradient overlay effect.",
  "frontend/src/components/ProfileSetupModal.tsx": "Modal dialog that prompts authenticated users without a profile to enter their name, using Internet Identity and profile mutation hooks.",
  "frontend/src/components/RatingDisplay.tsx": "Displays average rating with star icons and rating count for a given title, fetching data via useGetTitleRatings hook.",
  "frontend/src/components/RatingInput.tsx": "Interactive 5-star rating input component that allows authenticated users to rate a title, prompting login if unauthenticated.",
  "frontend/src/components/SearchBar.tsx": "Search input component that queries titles as user types and passes results to parent via callback, showing loading spinner during search.",
  "frontend/src/components/TitleCard.tsx": "Clickable card component displaying a title's cover image, name, type badge (film/series), and rating with hover effects.",
  "frontend/src/components/TitlesGrid.tsx": "Responsive grid layout component that renders an array of Title objects as TitleCard components.",
  "frontend/src/components/UploadProgress.tsx": "Progress indicator component showing file upload status with filename, size, progress bar, and completion state.",
  "frontend/src/components/VideoPlayer.tsx": "HTML5 video player component with loading and error states, displaying videos from ExternalBlob objects.",
  "frontend/src/hooks/useActor.ts": "React Query hook that creates and manages the backend actor instance, handling authentication state and invalidating dependent queries on identity changes.",
  "frontend/src/hooks/useInternetIdentity.ts": "Context provider and hook for Internet Identity authentication, managing login/logout flow, identity state, and AuthClient lifecycle with configurable options.",
  "frontend/src/hooks/useQueries.ts": "Defines React Query hooks for fetching and mutating titles, ratings, user profiles, and user roles using the backend actor. Includes hooks for CRUD operations on titles, rating titles, and managing user profiles with query invalidation on mutations.",
  "frontend/src/index.css": "Tailwind CSS configuration with custom CSS variables for theming (colors, borders, radius) in both light and dark modes. Sets base styles for body with system font stack and font smoothing.",
  "frontend/src/main.tsx": "Application entry point that sets up React Query client and Internet Identity provider, then renders the App component into the root DOM element.",
  "frontend/src/pages/AdminUploadPage.tsx": "Admin page for uploading video content with form inputs for title, description, type, video file (5GB max), and cover image. Handles file upload with progress tracking using ExternalBlob and displays upload progress UI.",
  "frontend/src/pages/HomePage.tsx": "Main landing page displaying a grid of all titles with search functionality. Shows loading skeletons during fetch and empty states when no content is available or search returns no results.",
  "frontend/src/pages/TitleDetailPage.tsx": "Detail page for individual titles showing video player, rating display/input, and admin delete functionality. Includes confirmation dialog for deletion and handles loading/error states.",
  "frontend/src/utils/urlParams.ts": "Utility functions for extracting and managing URL parameters from both query strings and hash-based routing. Provides sessionStorage persistence for parameters and methods to clear sensitive data from URLs.",
  "frontend/tailwind.config.js": "Tailwind CSS configuration file defining custom color schemes using OKLCH color space, extended theme settings including sidebar, chart, and semantic colors, custom animations for accordions, and plugins for typography, container queries, and animations.",
  "project_state.json": "Project state document describing a French streaming platform for movies/series with chunked video uploads (up to 5GB), public upload access with admin-only deletion, search, ratings, and existing features tracking implementation of admin functionality, search, ratings, French UI, and cinematic dark theme."
}